research/chamber-model/openfoam/chamber42_3d/0/T
FoamFile { version 2.0; format ascii; class volScalarField; object T; }
dimensions [0 0 0 1 0 0 0]; internalField uniform 325;
boundaryField { chip{type fixedValue;value uniform 358;} condenser{type fixedValue;value uniform 305;}
  floor{type zeroGradient;} walls{type zeroGradient;} top{type zeroGradient;} }
