research/chamber-model/openfoam/chamber42_3d/constant/phaseChangeProperties
FoamFile { version 2.0; format ascii; class dictionary; object phaseChangeProperties; }
phaseChangeTwoPhaseModel constant;
constantCoeffs { coeffC coeffC [0 0 -1 -1 0 0 0] 1.0; coeffE coeffE [0 0 -1 -1 0 0 0] 0.1; }
