research/chamber-model/openfoam/chamber42_3d/constant/thermophysicalProperties
FoamFile { version 2.0; format ascii; class dictionary; object thermophysicalProperties; }
TSat TSat [0 0 0 1 0 0 0] 338; pDivU false;
