research/chamber-model/openfoam/chamber42_3d/constant/transportProperties
FoamFile { version 2.0; format ascii; class dictionary; object transportProperties; }
phases (water vapour);
Prt Prt [0 0 0 0 0 0 0] 1.0;
sigma sigma [1 0 -2 0 0 0 0] 0.065;
water { transportModel Newtonian; nu nu [0 2 -1 0 0 0 0] 4.4e-07; rho rho [1 -3 0 0 0 0 0] 980;
  Cp Cp [0 2 -2 -1 0 0 0] 4190; Cv Cv [0 2 -2 -1 0 0 0] 4190; kappa kappa [1 1 -3 -1 0 0 0] 0.66; hf hf [0 2 -2 0 0 0 0] 0; }
vapour { transportModel Newtonian; nu nu [0 2 -1 0 0 0 0] 4.0e-04; rho rho [1 -3 0 0 0 0 0] 0.30;
  Cp Cp [0 2 -2 -1 0 0 0] 2030; Cv Cv [0 2 -2 -1 0 0 0] 1500; kappa kappa [1 1 -3 -1 0 0 0] 0.025; hf hf [0 2 -2 0 0 0 0] 2350e3; }
