research/chamber-model/openfoam/chamber42_3d/constant/turbulenceProperties
FoamFile { version 2.0; format ascii; class dictionary; object turbulenceProperties; }
simulationType laminar;
