research/chamber-model/openfoam/chamber42_3d/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
scale 1;
vertices ( (0 0 0)(0.08 0 0)(0.08 0.08 0)(0 0.08 0)(0 0 0.042)(0.08 0 0.042)(0.08 0.08 0.042)(0 0.08 0.042) );
blocks ( hex (0 1 2 3 4 5 6 7) (40 40 21) simpleGrading (1 1 1) );   // ~2 mm cells, 33600
edges ();
boundary
(
    floor { type wall; faces ( (0 3 2 1) ); }
    top   { type wall; faces ( (4 5 6 7) ); }
    walls { type wall; faces ( (0 4 7 3)(1 2 6 5)(0 1 5 4)(3 7 6 2) ); }
);
mergePatchPairs ();
