research/chamber-model/openfoam/chamber42_3d/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }
application interCondensatingEvaporatingFoam; startFrom startTime; startTime 0; stopAt endTime;
endTime 0.0008; deltaT 1e-6; writeControl adjustableRunTime; writeInterval 0.0001;
purgeWrite 0; writeFormat ascii; writePrecision 7; runTimeModifiable yes;
adjustTimeStep yes; maxCo 0.4; maxAlphaCo 0.4; maxDeltaT 5e-6;
