research/chamber-model/openfoam/chamber42_3d/system/createPatchDict
FoamFile { version 2.0; format ascii; class dictionary; object createPatchDict; }
pointSync false;
patches ( { name chip; patchInfo { type wall; } constructFrom set; set chipFaces; } );
