research/chamber-model/openfoam/chamber42_3d/system/setFieldsDict
FoamFile { version 2.0; format ascii; class dictionary; object setFieldsDict; }
defaultFieldValues ( volScalarFieldValue alpha.water 0 );
regions ( boxToCell { box (0 0 0)(0.08 0.08 0.0168); fieldValues ( volScalarFieldValue alpha.water 1 ); } );
