research/chamber-model/openfoam/chamber42_3d/system/surfaceFeatureExtractDict
FoamFile { version 2.0; format ascii; class dictionary; object surfaceFeatureExtractDict; }
tubes.stl { extractionMethod extractFromSurface; extractFromSurfaceCoeffs { includedAngle 150; } writeObj no; }
